import DiaryEntryDetails from "@/components/Diary/DiaryEntryDetails/DiaryEntryDetails";
import css from "./DiaryId.module.css";

interface NoteDetailsProps {
    params: Promise<{ id: string }>;
}

export default async function DiaryId({ params }: NoteDetailsProps) {
    const { id } = await params;
    console.log(id);
    return (
        <div className={css.container}>
            <DiaryEntryDetails diary={
                {
                    _id: id,
                    title: 'Побачити сімейний світ',
                    date: '15 липня 2025',
                    description: 'Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімПобачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.Побачити сімейний світ. Відпочити, поділитися та поділитися.ейний світ. Відпочити, поділитися та поділитися.',
                    emotions: [
                        {
                            _id: '1',
                            title: 'Позитивно'
                        },
                        {
                            _id: '2',
                            title: 'Нейтрально'
                        },
                        {
                            _id: '3',
                            title: 'Негативно'
                        }
                    ]
                }
            } />
        </div>
    );
}